# SlabShapeFailedTooThin Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
BuiltInFailures..::..SlabShapeFailures..::..SlabShapeFailedTooThin Property
BuiltInFailures..::..SlabShapeFailures Class See Also
---
The Floor or Roof is too thin for its given type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlabShapeFailedTooThin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlabShapeFailedTooThin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlabShapeFailedTooThin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlabShapeFailures Class
Autodesk.Revit.DB Namespace